// Killing Dragon Game

//สมาชิก
//นางสาวพรปวีณ์ ธนลไชยพัฒน์ รหัสนักศึกษา 65080500230
//นายรัชพล มณีนาถ รหัสนักศึกษา 65080500279


#include <iostream> //เปิดใช้งาน library จัดการค่ารับ-ส่ง
#include <windows.h> //เปิดใช้งาน library Graphical User Interface (GUI)
#include <string> // เปิดใช้งาน library จัดการ string
using namespace std; //ระบุว่า มีการใช้ object

void title(); //กำหนดฟังก์ชัน title
void Combat1(); //กำหนดฟังก์ชัน Combat1
void Over(); //กำหนดฟังก์ชัน Over
void Thegoodend(); //กำหนดฟังก์ชัน Thegoodend
void Thebadend(); //กำหนดฟังก์ชัน Thebadend
void Combat2(); //กำหนดฟังก์ชัน Combat2

string name = " "; //ประกาศตัวแปรข้อความ name

string monsterName = "The Last Dragon"; //ประกาศตัวแปรข้อความ monsterName = The Last Dragon (ชื่อสัตว์ประหลาด)
int monsterHP = 100; //ประกาศตัวแปรจำนวนเต็ม monsterHP (เลือดสัตว์ประหลาด) = 100
int monsterAttack = 30; //ประกาศตัวแปรจำนวนเต็ม monsterAttack (ค่าการโจมตีของสัตว์ประหลาด) = 30
int playerHp;//ประกาศตัวแปรจำนวนเต็ม playerHp (ค่าเลือดผู้เล่นขณะเล่น)


class player { //สร้างคลาส player
	
	string playerClass; //ประกาศตัวแปรข้อความ playerClass (บทบาทตัวละคร)

public: //ให้คลาสนี้เป็น public
	int attack,hp,def; //ประกาศตัวแปรจำนวนเต็ม attack(ค่าการโจมตีของผู้เล่น) hp(ค่าเลือดผู้เล่นเริ่มต้น) def(ค่าป้องกันผู้เล่นเริ่มต้น) 

	player(int choice) { //ให้ player เก็บค่า choice
		if (choice == 1) { //ถ้า choice=1 จะได้เล่นเป็น Swordman(นักดาบ) ซึ่งมีค่าการโจมตี ค่าเลือด ค่าป้องกัน ตามที่กำหนด
			playerClass = "Swordman";
			attack = 60;
			hp = 100;
			def = 80;
		}
		if (choice == 2) { //ถ้า choice=2 จะได้เล่นเป็น Wizard(พ่อมด) ซึ่งมีค่าการโจมตี ค่าเลือด ค่าป้องกัน ตามที่กำหนด
			playerClass = "Wizard";
			attack = 30;
			hp = 100;
			def = 60;
		}
		if (choice == 3) {//ถ้า choice=3 จะได้เล่นเป็น Hunter(นักล่า) ซึ่งมีค่าการโจมตี ค่าเลือด ค่าป้องกัน ตามที่กำหนด
			playerClass = "Hunter";
			attack = 90;
			hp = 70;
			def = 30;
		}
	}

	string printClass() { //ประกาศตัวแปรข้อความ ให้เรียกใช้ printClass()
		return playerClass; //แล้วจะ ส่งกลับ playerClass(บทบาทตัวละคร)
	}
    int printAttack() { //ประกาศตัวแปรจำนวนเต็ม ให้เรียกใช้ printAttack()
        return attack; //แล้วจะ ส่งกลับ attack(ค่าการโจมตีของผู้เล่น)
    }
	int printHP() { //ประกาศตัวแปรจำนวนเต็ม ให้เรียกใช้ printHP()
        return hp; //แล้วจะ ส่งกลับ hp(ค่าเลือดผู้เล่นเริ่มต้น) 
    }
	int printDEF() { //ประกาศตัวแปรจำนวนเต็ม ให้เรียกใช้ printDEF()
		return def; //แล้วจะ ส่งกลับ def(ค่าป้องกันผู้เล่นเริ่มต้น)
    }
} ;


int main() { //เปิดฟังก์ชันหลัก

    static CONSOLE_FONT_INFOEX  fontex; //คำสั่งคอนโซลฟอนต์
     fontex.cbSize = sizeof(CONSOLE_FONT_INFOEX);
     HANDLE hOut = GetStdHandle(STD_OUTPUT_HANDLE);
     GetCurrentConsoleFontEx(hOut, 0, &fontex);
     fontex.FontWeight = 500; //น้ำหนักของฟอนต์ = 500
     fontex.dwFontSize.X = 15; //ขนาดของฟอนต์ในแนวแกน x = 15
     fontex.dwFontSize.Y = 17.5; //ขนาดของฟอนต์ในแนวแกน y = 17.5 

    int selection; //ประกาศตัวแปร selection (ตัวเลือกหน้าเกม)

    title(); //เรียกใช้ void title (ไตเติลหน้าเกม)

    do { //คำสั่ง do เพื่อทำ 1 ครั้งก่อนตรวจสอบเงื่อนไขและวนลูป
    
    cout << " \n Please enter your selection: "; //แสดงผล ให้เลือกตัวเลือก
	
	cin >> selection;//รับค่าที่เลือก
    Sleep(800);//หน้าจอดำ 0.8 วินาที

	if (selection==1) { //ถ้าค่าที่เลือก=1

    system("cls");//ให้ระบบเคลียร์หน้าจอ

    string story = "\n In the once prosperous city  It was now an empty city with no people. \n People were hiding in a safe place because they were invaded by the Dragon Clan.\n that used to be ours back to their place. \n You are one of the citizens of this city. \n who want to kill the dragon tribe to take back what belongs to you";
    //ประกาศตัวแปรข้อความ story และใส่ข้อความเนื้อเรื่องลงไป

    int x=0;//ประกาศตัวแปรจำนวนเต็ม x=0
    while ( story[x] != '\0') { //วนลูปเมื่อ ข้อความใน story ไม่เป็น 0

        cout << story[x]; //แสดงผลข้อความใน story
            if ( story[x]!= ' ' && story[x]!= '\n') //ถ้า ข้อความใน story ไม่ได้ว่างเปล่า
		Beep(1000,30); //ส่งเสียงปี๊บ ที่ความถี่ 1000 เป็นเวลา 0.03 วินาที
        Sleep(30);//หน้าจอดำ 0.03 วินาที
        x++; //ให้ข้อความใน story เพิ่มขึ้นทีละตัว
    };//สรุป คือ แสดงผลแบบ type writing
    

    cout << R"(
                                 ____                                         
                              .-"    `-.      ,                               
                            .'          '.   /j\                              
                           /              \,/:/#\                /\           
                          ;              ,//' '/#\              //#\          
                          |             /' :   '/#\            /  /#\         
                          :         ,  /' /'    '/#\__..--""""/    /#\__      
                           \       /'\'-._:__    '/#\        ;      /#, """---
                            `-.   / ;#\']" ; """--./#J       ':____...!       
                               `-/   /#\  J  [;[;[;Y]         |      ;        
""""""---....             __.--"/    '/#\ ;   " "  |     !    |   #! |        
             ""--.. _.--""     /      ,/#\'-..____.;_,   |    |   '  |        
                   "-.        :_....___,/#} "####" | '_.-",   | #['  |        
                      '-._      |[;[;[;[;|         |.;'  /;\  |      |        
                      ,   `-.   |        :     _   .;'    /;\ |   #" |        
                      !      `._:      _  ;   ##' .;'      /;\|  _,  |        
                     .#\"""---..._    ';, |      .;{___     /;\  ]#' |__....--
          .--.      ;'/#\         \    ]! |       "| , """--./_J    /         
         /  '%;    /  '/#\         \   !' :        |!# #! #! #|    :`.__      
        i__..'%] _:_   ;##J         \      :"#...._!   '  "  "|__  |    `--.._
         | .--""" !|""""  |"""----...J     | '##"" `-._       |  """---.._    
     ____: |      #|      |         #|     |          "]      ;   ___...-"T,  
    /   :  :      !|      |   _______!_    |           |__..--;"""     ,;MM;  
   :____| :    .-.#|      |  /\      /#\   |          /'               ''MM;  
    |""": |   /   \|   .----+  ;      /#\  :___..--"";                  ,'MM; 
   _Y--:  |  ;     ;.-'      ;  \______/#: /         ;                  ''MM; 
  /    |  | ;_______;     ____!  |"##"""MM!         ;                    ,'MM;
 !_____|  |  |"#"#"|____.'""##"  |       :         ;                     ''MM  
  | """"--!._|     |##""         !       !         :____.....-------"""""" |'
  |          :     |______                        ___!_ "#""#""#"""#"""#"""|  
__|          ;     |MM"MM"""""---..._______...--""MM"MM]                   |   
  "\-.      :      |#                                  :                   |  
    /#'.    |      /##,                                !                   |  
   .',/'\   |       #:#,                                ;       .==.       |  
  /"\'#"\',.|       ##;#,                               !     ,'||||',     |  
        /;/`:       ######,          ____             _ :     M||||||M     |  
       ###          /;"\.__"-._   """                   |===..M!!!!!!M_____|     
    )" << '\n';//แสดงผล ACSII Art รูปปราสาท
    system ("pause"); //ให้ระบบหยุดทำงานจนกว่าจะมีการกดปุ่มใดๆ
        }

    else if (selection==2) {//ถ้าค่าที่เลือก = 2
            cout << "\n   This game made from Pawnpawee Tanonchaiyaphat 65080500230"<<endl;
            cout << "                       Ratchapol Maneenat        65080500279\n"<<endl;
            //แสดงผลข้อมูลตามที่ระบุ
            system ("pause");//ให้ระบบหยุดทำงานจนกว่าจะมีการกดปุ่มใดๆ
        }
    else if (selection==0) {//ถ้าค่าที่เลือก = 0
        return 0;//ระบบหยุดทำงาน ออกจากโปรแกรม
        }
    else if (!cin >> selection || selection > 2 || selection < 0) {
    //ถ้าไม่ได้รับค่าตัวเลือก หรือค่าที่ได้มากกว่า 2 หรือน้อยกว่า 0
        cout << "\n Not a valid selection.\n"; //แสดงผล ไม่พบตัวเลือก
    }
    }
    while (selection==2 || !cin >> selection || selection > 2 || selection < 0); 
    //วนลูปเมื่อ ค่าที่เลือก=2 หรือ ไม่ได้รับค่าตัวเลือก หรือค่าที่ได้มากกว่า 2 หรือน้อยกว่า 0

    system ("cls");//ให้ระบบเคลียร์หน้าจอ
    cout << "\n Choose your character class. \n [1] Swordman [2] Wizard [3] Hunter : ";
    //แสดงผลให้เลือกตัวละคร กด1 Swordman กด2 Wizard กด3 Hunter
	int choice; //ประกาศตัวแปรจำนวนเต็ม choice (ตัวเลือกตัวละคร)
	cin >> choice; //รับค่าที่เลือก

	while (!cin >> choice || choice > 3 || choice < 1) {
    //วนลูปไปทำอีกครั้ง เมื่อ ไม่ได้รับค่าตัวเลือก หรือ ค่าที่ได้มากกว่า 3 หรือ น้อยกว่า 1 
		cout << " Not a valid choice. \nChoose your character class. \n[1] Swordman [2] Wizard [3] Hunter : ";
		cin >> choice;
	}//แสดงผล ให้เลือกใหม่อีกครั้ง

	player character(choice); //เรียกใช้คลาส player ให้ character เป็นไปตาม choice ที่เลือก
	cout << "\n Welcome " << character.printClass() << ". Let's begin your adventure." << endl;
    //แสดงผล ยินดีต้อนรับ ตัวละครที่ผู้เล่นเลือก
	
    cout << "\n Enter Characters Name: "; //แสดงผล ให้กรอกชื่อตัวละคร
    cin >> name; //รับค่าชื่อตัวละคร
    Sleep(500); //หน้าจอดำเป็นเวลา 0.5 วินาที
    system("cls"); //ให้ระบบเคลียร์หน้าจอ

    cout << "\nCreating Character.\n";
    cout << "\nCreating Character.\n";
    cout << "\nCreating Character.\n";
    Sleep(500);
    system("cls");

    cout << "\nCreating Character..\n";
    cout << "\nCreating Character..\n";
    cout << "\nCreating Character..\n";
    Sleep(500);
    system("cls");

    cout << "\nCreating Character...\n";
    cout << "\nCreating Character...\n";
    cout << "\nCreating Character...\n";
    Sleep(300);
    system("cls");
    
    Sleep(500);
    system("cls");
    //แสดงผล กำลังสร้างตัวละคร

     cout << "\n Name: " << name << "          Character: " <<  character.printClass() << endl;
	 cout << " Attack: " << character.printAttack() <<endl;
	 cout << " HP: " <<  character.printHP() << endl; 
	 cout << " DEF: " << character.printDEF() << endl;
    //แสดงผล ชื่อตัวละคร บทบาทตัวละคร ค่าการโจมตี ค่าเลือด ค่าป้องกัน
    system("pause"); //ให้ระบบหยุดจนกว่าจะมีการกดปุ่มใดๆ

	Sleep(1000); //หน้าจอดำเป็นเวลา 1 วินาที
    system("cls"); //ให้ระบบเคลียร์หน้าจอ

    Sleep(500); //หน้าจอดำเป็นเวลา 0.5 วินาที
    system("cls"); //ให้ระบบเคลียร์หน้าจอ

    char chooseagain; //ประกาศตัวแปรตัวอักษร ให้เลือกอีกครั้ง
    char choose; //ประกาศตัวแปรตัวอักษร ให้เลือก 
	do { //คำสั่ง do เพื่อทำ 1 ครั้งก่อนตรวจสอบเงื่อนไขและวนลูป
	 	cout << "\nAre you ready for FIGHT y/n : ";
        // แสดงผล ถามผู้เล่นว่าพร้อมจะต่อสู้ไหม
	 	cin >> choose; //รับค่าที่เลือก
        
		if (choose=='y') {//ถ้าเลือก y 
		Sleep(800); //หน้าจอดำ 0.8 วินาที
    	system("cls"); //ให้ระบบเคลียร์หน้าจอ
        goto label1; //ไปที่ label1
		}

		else if (choose=='n') {//ถ้าเลือก n
        Over(); //เรียกใช้ void Over (แพ้)
		cout << "Do you want to choose again? y/n:"; //แสดงผล ถามว่าจะเลือกอีกครั้งหรือไม่
		cin >> chooseagain;	//รับค่าที่เลือก
	    }

        else if ((choose!='y')&&(choose!='n')) { //ถ้าเลือกตัวอักษรอื่น
        cout << "\n Not a valid selection.\n"; //แสดงผล ไม่พบการเลือก
        }

	}while (chooseagain=='y' || (choose!='y')&&(choose!='n'));//วนลูป เมื่อเลือก y หรือ เลือกตัวอักษรอื่นๆ
    if (chooseagain=='n'){//ถ้าเลือก n 
        Thebadend();//เรียกใช้ void Thebadend (ตอนจบไม่ดี)
        goto label2;//ไปที่ label2
    }

label1 :
    do{ //คำสั่ง do เพื่อทำ 1 ครั้งก่อนตรวจสอบเงื่อนไขและวนลูป
        Sleep(800); //หน้าจอเป็นเวลา 0.8 วินาที
        system("cls"); //ให้ระบบเคลียร์หน้าจอ

        Combat1();//เรียกใช้ void Combat1 (การต่อสู้1)

        int playerAction; //ประกาศตัวแปรจำนวนเต็ม playerAction (การกระทำของผู้เล่น)
        cout << "\n You ........";
        cout << "\n Attack [1]"<<endl;
        cout << " Run [2]"<<endl;
        cout << " Defend [3]"<<endl;
        cout << " You ........";//แสดงผลให้ผู้เล่นเลือก กด1 โจมตี กด2 วิ่งหนี กด3 ป้องกัน
        cin >> playerAction;//รับค่าที่เลือก
        
        while(!cin >> playerAction || playerAction > 3 || playerAction < 1) { 
            //เมื่อ ไม่ได้รับค่าตัวเลือก หรือ ค่าที่ได้มากกว่า 3 หรือ น้อยกว่า 1 
            cout << " Not a valid choice. \n Choose again : ";
            //แสดงผล ไม่พบตัวเลือก เลือกอีกครั้ง
		    cin >> playerAction; //รับค่าที่เลือก
        }
        if (playerAction==1){ //ถ้า playerAction=1
            cout <<" \nYou Acttack on The Dragon... " <<endl;
            cout << " Your Attack: " << character.printAttack() <<endl;
            //แสดงผล คุณโจมตีมังกร ค่าการโจมตี.... (อ้างอิงค่าจากตัวละครที่เลือก)

            monsterHP = monsterHP-character.printAttack();
            //ให้ เลือดของสัตว์ประหลาด = เลือดของสัตว์ประหลาด-ค่าการโจมตีของผู้เล่น

            cout << " The Dragon was Acttack \n DragonHP : " << monsterHP << endl;
            //แสดงผล มังกรโดนโจมตี เลือดของมังกร...

            system("pause");//ให้ระบบหยุดทำงานจนกว่าจะมีการกดปุ่มใดๆ
        }   
        else if (playerAction==2) { //ถ้า playerAction=2 
            Over(); //เรียกใช้ void Over
            Sleep(1000); //หน้าจอดำ 1 วินาที
            Thebadend(); //เรียกใช้ void Thebadend
            return 0; //ระบบหยุดทำงาน ออกจากโปรแกรม
        }
        else if (playerAction==3) { //ถ้า playerAction=3
            cout << "Nothing happen... what are you doing ?" <<endl;
            //แสดงผลว่า ไม่มีอะไรเกิดขึ้น คุณทำอะไรของคุณ?
        }

    Sleep(800); //หน้าจอดำ 0.8 วินาที
    system("cls"); //ให้ระบบเคลียร์หน้าจอ
    Combat2 (); //เรียกใช้ void Combat2 (การต่อสู้2)

    int playerAction2; //ประกาศตัวแปรจำนวนเต็ม playerAction2 (การกระทำของผู้เล่น2)

        cout << "\n You ........";
        cout << "\n Attack [1]"<<endl;
        cout << " Run [2]"<<endl;
        cout << " Defend [3]"<<endl;
        cout << " You ........";//แสดงผลให้ผู้เล่นเลือก กด1 โจมตี กด2 วิ่งหนี กด3 ป้องกัน
        cin >> playerAction2;//รับค่าที่เลือก
        
        while(!cin >> playerAction2 || playerAction2 > 3 || playerAction2 < 1) { 
            //เมื่อ ไม่ได้รับค่าตัวเลือก หรือ ค่าที่ได้มากกว่า 3 หรือ น้อยกว่า 1 
            cout << " Not a valid choice. \n Choose again : "; 
            //แสดงผล ไม่พบตัวเลือก เลือกอีกครั้ง
		    cin >> playerAction2;//รับค่าที่เลือก
        }

        if (playerAction2==1){ //ถ้า playerAction2=1
            cout <<" \n You Acttack on The Dragon..." <<endl; 
            cout << " Your Attack: " << character.printAttack() <<endl;
            //แสดงผล คุณโจมตีมังกร ค่าการโจมตี.... (อ้างอิงค่าจากตัวละครที่เลือก)

            monsterHP = monsterHP-character.printAttack();
            //ให้ เลือดของสัตว์ประหลาด = เลือดของสัตว์ประหลาด-ค่าการโจมตีของผู้เล่น

            cout <<" But you are attacked back"<<endl;
            //แสดงผล แต่คุณถูกโจมตีกลับ

            playerHp = (character.printHP()+character.printDEF())-monsterAttack;
            //เลือดของผู้เล่นขณะเล่น = (ค่าเลือด+ค่าการป้องกันของผู้เล่น)-ค่าการโจมตีของสัตว์ประหลาด

            cout <<" Your HP : " << playerHp << endl;
            cout << " The Dragon was Acttack \n DragonHP : " << monsterHP << endl;
            //แสดงผล เลือดของผู้เล่นขณะเล่น... และ มังกรถูกโจมตี เลือดของมังกร...
            system("pause");//ให้ระบบหยุดจนกว่าจะมีการกดปุ่มใดๆ
        }
        else if (playerAction2==2) { //ถ้า playerAction2=2  
            Over(); //เรียกใช้ void Over
            Sleep(1000); //หน้าจอดำ 1 วินาที
            Thebadend(); //เรียกใช้ void Thebadend
            return 0; //ระบบหยุดทำงาน ออกจากโปรแกรม
        }
        else if (playerAction2==3) {
            cout << "Nothing happen... what are you doing ?" <<endl;
            //แสดงผลว่า ไม่มีอะไรเกิดขึ้น คุณทำอะไรของคุณ?
        }
	}while ((monsterHP>=1) && (playerHp>=1)); 
    //วนลูป เมื่อ เลือดของสัตว์ประหลาด และ เลือดของผู้เล่นขณะเล่น มากกว่าเท่ากับ1
    if (monsterHP<=0) { //ถ้าเลือดของสัตว์ประหลาด น้อยกว่าเท่ากับ 0
        Thegoodend(); //เรียกใช้ void Thegoodend (ตอนจบดี)
        goto label2; //ไปที่ label2
    }
    if (playerHp<=0) { //ถ้าเลือดของผู้เล่นขณะเล่น น้อยกว่าเท่ากับ 0
        Thebadend(); //เรียกใช้ void Thebadend
        goto label2; //ไปที่ label2
    }

label2 :
    system ("pause"); //ให้ระบบหยุดจนกว่าจะมีการกดปุ่มใดๆ
	return 0; //ระบบหยุดทำงาน ออกจากโปรแกรม
}

void title() { //ฟังก์ชัน ไตเติ้ลหน้าเกม

    std::cout << R"(

                                                                                                                                                                                   
 ____    ____   ____  ____         ____         ____  _____   ______         _____               _____        _____          ____         _____            _____  _____   ______   
|    |  |    | |    ||    |       |    |       |    ||\    \ |\     \    ___|\    \          ___|\    \   ___|\    \    ____|\   \    ___|\    \      ____|\    \|\    \ |\     \  
|    |  |    | |    ||    |       |    |       |    | \\    \| \     \  /    /\    \        |    |\    \ |    |\    \  /    /\    \  /    /\    \    /     /\    \\\    \| \     \ 
|    | /    // |    ||    |       |    |       |    |  \|    \  \     ||    |  |____|       |    | |    ||    | |    ||    |  |    ||    |  |____|  /     /  \    \\|    \  \     |
|    |/ _ _//  |    ||    |  ____ |    |  ____ |    |   |     \  |    ||    |    ____       |    | |    ||    |/____/ |    |__|    ||    |    ____ |     |    |    ||     \  |    |
|    |\    \'  |    ||    | |    ||    | |    ||    |   |      \ |    ||    |   |    |      |    | |    ||    |\    \ |    .--.    ||    |   |    ||     |    |    ||      \ |    |
|    | \    \  |    ||    | |    ||    | |    ||    |   |    |\ \|    ||    |   |_,  |      |    | |    ||    | |    ||    |  |    ||    |   |_,  ||\     \  /    /||    |\ \|    |
|____|  \____\ |____||____|/____/||____|/____/||____|   |____||\_____/||\ ___\___/  /|      |____|/____/||____| |____||____|  |____||\ ___\___/  /|| \_____\/____/ ||____||\_____/|
|    |   |    ||    ||    |     |||    |     |||    |   |    |/ \|   ||| |   /____ / |      |    /    | ||    | |    ||    |  |    || |   /____ / | \ |    ||    | /|    |/ \|   ||
|____|   |____||____||____|_____|/|____|_____|/|____|   |____|   |___|/ \|___|    | /       |____|____|/ |____| |____||____|  |____| \|___|    | /   \|____||____|/ |____|   |___|/
  \(       )/    \(    \(    )/     \(    )/     \(       \(       )/     \( |____|/          \(    )/     \(     )/    \(      )/     \( |____|/       \(    )/      \(       )/  
   '       '      '     '    '       '    '       '        '       '       '   )/              '    '       '     '      '      '       '   )/           '    '        '       '   
                                                                               '                                                            '                                      

)" << '\n';//แสดงผล ACSII Art kill dragon

    std::cout << R"(

                               .---------.                                           .---------.                                                   .---------.
                               |  play   |                                           |  info   |                                                   |  exit   |
                               | press 1 |                                           | press 2 |                                                   | press 0 |
                               '---------'                                           '---------'                                                   '---------'

    )" << '\n'; //แสดงผล ACSII Art รูปปุ่มตัวเลือก
}

void Over() { //ฟังก์ชัน แพ้

    Sleep(500);//หน้าจอดำ 0.5 วินาที
    system("cls"); //ให้ระบบเคลียร์หน้าจอ
    cout << "You so weak. The Dragon kill you: ";
    //แสดงผล คุณอ่อนแอเกินไป มังกรฆ่าคุณ
    std::cout << R"(

			G A M E O V E R            
			             __
                     _.-'.-'-.__
                  .-'.       '-.'-._ __.--._
           -..'\,-,/..-  _         .'   \   '----._
            ). /_ _\' ( ' '.         '-  '/'-----._'-.__
            '..'     '-r   _      .-.       '-._ \
            '.\. Y .).'       ( .'  .      .\          '\'.
            .-')'|'/'-.        \)    )      '',_      _.c_.\
              .<, ,>.          |   _/\        . ',   :   : \\
             .' \_/ '.        /  .'   |          '.     .'  \)
                             / .-'    '-.        : \   _;   ||
            YOU LOSER...    / /    _     \_      '.'\ ' /   ||
                           /.'   .'        \_      .|   \   \|
                          / /   /      __.---'      '._  ;  ||
                         /.'  _:-.____< ,_           '.\ \  ||
                        // .-'     '-.__  '-'-\_      '.\/_ \|
                       ( };====.===-==='        '.    .  \\: \
                        \\ '._        /          :   ,'   )\_ \
                         \\   '------/            \ .    /   )/
                          \|        _|             )Y    |   /
                           \\      \             .','   /  ,/
                            \\    _/            /     _/
                             \\   \           .'    .'
                              '| '1          /    .'
                                '. \        |:    /
                                  \ |       /', .'
                                   \(      ( ;z'
                                    \:      \ '(_
                                     \_,     '._ '-.___
                                              '-' -.\
	)" << '\n';//แสดงผล ACSII Art รูปมังกร
}

void Combat1() { //ฟังก์ชัน การต่อสู้1

		cout << "\n" << monsterName << " !";
		std::cout << R"(
			            `-._                           
	                       `:.`---.__         `-._                       
          YOU ARE WEAK        `:.     `--.         `.                     
                                 \.        `.         `.                   
                         (,,(,    \.         `.   ____,-`.,                
                      (,'     `/   \.   ,--.___`.'                         
                  ,  ,'  ,--.  `,   \.;'         `                         
                   `{D, {    \  :    \;                                    
                     V,,'    /  /    //                                    
                     j;;    /  ,' ,-//.    ,---.      ,                    
                     \;'   /  ,' /  _  \  /  _  \   ,'/                    
                           \   `'  / \  `'  / \  `.' /                     
                            `.___,'   `.__,'   `.__,'  
	)" << '\n';
    //แสดงผล ACSII Art รูปมังกร 
	
		cout << monsterName << " \n HP: " << monsterHP; 
        cout << "          Attack: "<< monsterAttack << "\n It threaten at you "<<endl;
        //แสดงผล ชื่อสัตว์ประหลาด เลือดและค่าการโจมตีของสัตว์ประหลาด และมันกำลังขู่คุณอยู่
	}

void Thegoodend() { // ฟังก์ชัน ตอนจบดี
    Sleep(500);//หน้าจอดำ 0.5 วินาที
    system("cls"); //ให้ระบบเคลียร์หน้าจอ
    std::cout << R"(   
          
 .----------------. .----------------. .----------------.   .----------------. .----------------. .-----------------.
| .--------------. | .--------------. | .--------------. | | .--------------. | .--------------. | .--------------. |
| |  ____  ____  | | |     ____     | | | _____  _____ | | | | _____  _____ | | |     _____    | | | ____  _____  | |
| | |_  _||_  _| | | |   .'    `.   | | ||_   _||_   _|| | | ||_   _||_   _|| | |    |_   _|   | | ||_   \|_   _| | |
| |   \ \  / /   | | |  /  .--.  \  | | |  | |    | |  | | | |  | | /\ | |  | | |      | |     | | |  |   \ | |   | |
| |    \ \/ /    | | |  | |    | |  | | |  | '    ' |  | | | |  | |/  \| |  | | |      | |     | | |  | |\ \| |   | |
| |    _|  |_    | | |  \  `--'  /  | | |   \ `--' /   | | | |  |   /\   |  | | |     _| |_    | | | _| |_\   |_  | |
| |   |______|   | | |   `.____.'   | | |    `.__.'    | | | |  |__/  \__|  | | |    |_____|   | | ||_____|\____| | |
| |              | | |              | | |              | | | |              | | |              | | |              | |
| '--------------' | '--------------' | '--------------' | | '--------------' | '--------------' | '--------------' |
 '----------------' '----------------' '----------------'   '----------------' '----------------' '----------------' 

                                  ==(W{==========-      /===-                        
                              ||  (.--.)         /===-_---~~~~~~~~~------____  
                              | \_,|**|,__      |===-~___                _,-' `
                 -==\\        `\ ' `--'   ),    `//~\\   ~~~~`---.___.-~~      
             ______-==|        /`\_. .__/\ \    | |  \\           _-~`         
       __--~~~  ,-/-==\\      (   | .  |~~~~|   | |   `\        ,'             
    _-~       /'    |  \\     )__/==0==-\<>/   / /      \      /               
  .'        /       |   \\      /~\___/~~\/  /' /        \   /'                
 /  ____  /         |    \`\.__/-~~   \  |_/'  /          \/'                  
/-'~    ~~~~~---__  |     ~-/~         ( )   /'        _--~`                   
                  \_|      /        _) | ;  ),   __--~~                        
                    '~~--_/      _-~/- |/ \   '-~ \                            
                   {\__--_/}    / \\_>-|)<__\      \                           
                   /'   (_/  _-~  | |__>--<__|      |                          
                  |   _/) )-~     | |__>--<__|      |                          
                  / /~ ,_/       / /__>---<__/      |                          
                 o-o _//        /-~_>---<__-~      /                           
                 (^(~          /~_>---<__-      _-~                            
                ,/|           /__>--<__/     _-~                               
             ,//('(          |__>--<__|     /                  .----_          
            ( ( '))          |__>--<__|    |                 /' _---_~\        
         `-)) )) (           |__>--<__|    |               /'  /     ~\`\      
        ,/,'//( (             \__>--<__\    \            /'  //        ||      
      ,( ( ((, ))              ~-__>--<_~-_  ~--____---~' _/'/        /'       
    `~/  )` ) ,/|                 ~-_~>--<_/-__       __-~ _/                  
  ._-~//( )/ )) `                    ~~-'_/_/ /~~~~~~~__--~                    
   ;'( ')/ ,)(                              ~~~~~~~~~~                         
  ' ') '( (/                                                                   
    '   '  `
)" << '\n'; //แสดงผล ACSII Art รูปมังกรและอัศวิน 
}

void Thebadend() { //ฟังก์ชันตอนจบไม่ดี

    Sleep(500);//หน้าจอดำ 0.5 วินาที
    system("cls"); //ให้ระบบเคลียร์หน้าจอ
    cout << "\n Sorry about your lost..." <<endl;
    //แสดงผล เสียใจด้วย สำหรับการสูญเสียของคุณ...
    

    std::cout << R"(
                                        .___.
                    /)               ,-^     ^-. 
                   //               /           \
          .-------| |--------------/  __     __  \-------------------.__
          |WMWMWMW| |>>>>>>>>>>>>> | />>\   />>\ |>>>>>>>>>>>>>>>>>>>>>>:>
          `-------| |--------------| \__/   \__/ |-------------------'^^
                   \\               \    /|\    /
                    \)               \   \_/   /
                                      |       |
                                      |+H+H+H+|
                                      \       /
                                       ^-----^

    )" << '\n';
    //แสดงผล ACSII Art รูปตาย
}

void Combat2() { //ฟังก์ชัน การต่อสู้2
		cout << monsterName << "\n ANGRY it going to ATTACK !";
        //แสดงผล ชื่อสัตว์ประหลาด และ กำลังโกรธ ทำท่าจะโจมตี
        cout << "\n HP: " << monsterHP << "          Attack: 30 ";
        //แสดงผล เลือดและค่าโจมตีของสัตว์ประหลาด
		std::cout << R"(    
                                       \/
                                       ^`'.
                                       ^   `'.
             (                         ^      `'.
           )  )        \/              ^         `'.
         (   ) @       /^              ^            `'.
       )  )) @@  )    /  ^             ^               `'.
      ( ( ) )@@      /    ^            ^                  `'.
    ))  ( @@ @ )    /      ^           ^                     `'.
   ( ( @@@@@(@     /       |\_/|,      ^                        `'.
  )  )@@@(@@@     /      _/~/~/~|C     ^                           `'.
((@@@(@@@@@(     /     _(@)~(@)~/\C    ^                              `'.
  ))@@@(@@)@@   /     /~/~/~/~/`\~`C   ^             __.__               `'.
   )@@@@(@@)@@@(     (o~/~o)^,) \~ \C  ^          .' -_'-'"...             `.
    ( (@@@)@@@(@@@@@@_~^~^~,-/\~ \~ \C/^        /`-~^,-~-`_~-^`;_           `.
      @ )@@@(@@@@@@@   \^^^/  (`^\.~^ C^.,  /~^~^~^/_^-_`~-`~-~^\- /`'-./`'-. ;
       (@ (@@@@(@@      `''  (( ~  .` .,~^~^-`-^~`/'^`-~ _`~-`_^-~\         ^^
           @jgs@             (((` ~ .-~-\ ~`-_~`-/_-`~ `- ~-_- `~`;
          /                 /~((((` . ~-~\` `  ~ |:`-_-~_~`  ~ _`-`;
         /   You can't     /~-((((((`.\-~-\ ~`-`~^\- ^_-~ ~` -_~-_`~`;
        /     BEAT me!    /-~-/(((((((`\~-~\~`^-`~`\ -~`~\-^ -_~-_`~-`;
       /                 /~-~/  `((((((|-~-|((`.-~.`Y`_,~`\ `,- ~-_`~-`;
      /              ___/-~-/     `""""|~-~|"''    /~-^ .'    `:~`-_`~-~`;
     /         _____/  /~-~/           |-~-|      /-~-~.`      `:~^`-_`^-:
    /    _____/        ((((            ((((      (((((`           `:~^-_~-`;
    \___/                                                          `:_^-~`;
                                                                    `:~-^`:
                                                                  ,`~-~`,`
                                                                 ,"`~.,'
                                                               ,"-`,"`
                                                             ,"_`,"
                                                            ,","`
                                                         ;~-~_~~;
                                                          '. ~.'
     
	)" << '\n';//แสดงผล ACSII Art รูปมังกรพ่นไฟ 
	}


